## Production: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 22 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_cloudformation_stack.notification_history_joined` |
|        | `aws_iam_policy.quicksight-rds`                        |
|        | `aws_iam_policy.quicksight_vpc_connection_ec2`         |
|        | `aws_iam_policy.quicksight_vpc_connection_iam`         |
|        | `aws_iam_role.quicksight`                              |
|        | `aws_iam_role.vpc_connection_role`                     |
|        | `aws_iam_role_policy_attachment.ec2-qs-attach`         |
|        | `aws_iam_role_policy_attachment.iam-qs-attach`         |
|        | `aws_iam_role_policy_attachment.rds-qs-attach`         |
|        | `aws_quicksight_account_subscription.subscription`     |
|        | `aws_quicksight_data_set.jobs`                         |
|        | `aws_quicksight_data_set.notification_history`         |
|        | `aws_quicksight_data_set.notifications`                |
|        | `aws_quicksight_data_set.organisation`                 |
|        | `aws_quicksight_data_set.services`                     |
|        | `aws_quicksight_data_set.services_history`             |
|        | `aws_quicksight_data_set.templates`                    |
|        | `aws_quicksight_data_set.templates_history`            |
|        | `aws_quicksight_data_source.rds`                       |
|        | `aws_quicksight_group.dataset_owner`                   |
|        | `aws_quicksight_group.dataset_viewer`                  |
|        | `aws_quicksight_vpc_connection.rds`                    |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/6958978529).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudformation_stack.notification_history_joined will be created
  + resource "aws_cloudformation_stack" "notification_history_joined" {
      + id                = (known after apply)
      + name              = "notification-history-joined"
      + notification_arns = [
          + "arn:aws:sns:ca-central-1:296255494825:aws-controltower-SecurityNotifications",
        ]
      + outputs           = (known after apply)
      + parameters        = (known after apply)
      + policy_body       = (known after apply)
      + tags_all          = (known after apply)
      + template_body     = (known after apply)
    }

  # aws_iam_policy.quicksight-rds will be created
  + resource "aws_iam_policy" "quicksight-rds" {
      + arn         = (known after apply)
      + description = "Allow access to RDS"
      + id          = (known after apply)
      + name        = "rds-access"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:Describe*",
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.quicksight_vpc_connection_ec2 will be created
  + resource "aws_iam_policy" "quicksight_vpc_connection_ec2" {
      + arn         = (known after apply)
      + description = "EC2 permissions for the Quicksight VPC connection"
      + id          = (known after apply)
      + name        = "quicksight-vpc-connection-ec2"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.quicksight_vpc_connection_iam will be created
  + resource "aws_iam_policy" "quicksight_vpc_connection_iam" {
      + arn         = (known after apply)
      + description = "IAM permissions for the Quicksight VPC connection"
      + id          = (known after apply)
      + name        = "quicksight-vpc-connection-iam"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:AttachRolePolicy",
                          + "iam:CreateRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::296255494825:role/service-role/aws-quicksight-service-role-v0",
                          + "arn:aws:iam::296255494825:role/service-role/aws-quicksight-s3-consumers-role-v0",
                        ]
                      + Sid      = "VisualEditor0"
                    },
                  + {
                      + Action   = [
                          + "iam:ListPolicies",
                          + "iam:GetPolicyVersion",
                          + "iam:GetRole",
                          + "iam:GetPolicy",
                          + "iam:ListPolicyVersions",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GenerateServiceLastAccessedDetails",
                          + "iam:ListEntitiesForPolicy",
                          + "iam:ListPoliciesGrantingServiceAccess",
                          + "iam:ListRoles",
                          + "iam:GetServiceLastAccessedDetails",
                          + "iam:ListAccountAliases",
                          + "iam:ListRolePolicies",
                          + "s3:ListAllMyBuckets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor1"
                    },
                  + {
                      + Action   = [
                          + "iam:DeletePolicy",
                          + "iam:CreatePolicy",
                          + "iam:CreatePolicyVersion",
                          + "iam:DeletePolicyVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::296255494825:policy/service-role/AWSQuickSightIAMPolicy",
                          + "arn:aws:iam::296255494825:policy/service-role/AWSQuickSightRDSPolicy",
                          + "arn:aws:iam::296255494825:policy/service-role/AWSQuickSightS3Policy",
                          + "arn:aws:iam::296255494825:policy/service-role/AWSQuickSightRedshiftPolicy",
                          + "arn:aws:iam::296255494825:policy/service-role/AWSQuickSightS3ConsumersPolicy",
                        ]
                      + Sid      = "VisualEditor2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.quicksight will be created
  + resource "aws_iam_role" "quicksight" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "quicksight"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.vpc_connection_role will be created
  + resource "aws_iam_role" "vpc_connection_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ec2-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "ec2-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.iam-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "iam-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.rds-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "rds-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "quicksight"
    }

  # aws_quicksight_account_subscription.subscription will be created
  + resource "aws_quicksight_account_subscription" "subscription" {
      + account_name                = "quicksight-production-296255494825"
      + account_subscription_status = (known after apply)
      + authentication_method       = "IAM_ONLY"
      + aws_account_id              = (known after apply)
      + edition                     = "ENTERPRISE"
      + id                          = (known after apply)
      + notification_email          = "helpdesk@cds-snc.ca"
    }

  # aws_quicksight_data_set.jobs will be created
  + resource "aws_quicksight_data_set" "jobs" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "jobs"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Jobs"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "jobs"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "jobs"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_count"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_delivered"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_failed"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_sent"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "processing_finished"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "processing_started"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "scheduled_for"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
            }
        }
    }

  # aws_quicksight_data_set.notification_history will be created
  + resource "aws_quicksight_data_set" "notification_history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notification_history"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notification history"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "notification-history"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "notification_history"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }
        }
    }

  # aws_quicksight_data_set.notifications will be created
  + resource "aws_quicksight_data_set" "notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notifications"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "notifications"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "notifications"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }
        }
    }

  # aws_quicksight_data_set.organisation will be created
  + resource "aws_quicksight_data_set" "organisation" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "organisation"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Organisation"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "organisation"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "organisation"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "organisation_type"
                  + type = "STRING"
                }
            }
        }
    }

  # aws_quicksight_data_set.services will be created
  + resource "aws_quicksight_data_set" "services" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "services"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Services"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "services"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "services"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "sms_daily_limit"
                  + type = "INTEGER"
                }
            }
        }
    }

  # aws_quicksight_data_set.services_history will be created
  + resource "aws_quicksight_data_set" "services_history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "services_history"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Services history"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "services-history"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "services_history"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "sms_daily_limit"
                  + type = "INTEGER"
                }
            }
        }
    }

  # aws_quicksight_data_set.templates will be created
  + resource "aws_quicksight_data_set" "templates" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "templatesv2"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "TemplatesV2"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "templates"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "templates"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "process_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "version"
                  + type = "INTEGER"
                }
            }
        }
   ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notification_history_joined"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
